package _01_ElementsJava._02_Variables;

public class _01_Variables {

	/*
	Переменная–это именованная область памяти, которая хранит в себе некоторое значение, которое можно изменить.
	При создании переменной необходимо указать:
		•Имя переменной (идентификатор)
		•Тип переменной 
		•Начальное значение (необязательно)
 
 
 	Имена переменных должны быть понятны и передавать смысл хранимого значения.
 	Первый символ идентификатор
 		Допустимые символы : A-Z, a-z, _ , $ 
 	Остальные символы идентификатора
		Допустимые символы : A-Z, a-z, _ , $, 0-9
 
 	Нельзя использовать в качестве идентификаторов  зарезервированные ключевые слова
  	Ключевые слова – это предварительно определенные зарезервированные идентификаторы,
  	имеющие специальные значения для компилятора.
 
 	Спецификация языка JAVA рекомендует придерживаться определенных правил(casing conventions) 
 	при создании идентификаторов.
	 * */
	
}
